<?php
// смена языка
function lang($langchange)
{

    
    // смена на казахский
    if ($langchange == 'kz') {
        $lang = [
            
            // меню
            'menu'=>[
                'Жағдай', 
                'Байланыстар',
                'Неге біз?',
                'Алеуметтік желілердеміз',
                'Біз туралы'
                
            ],
            // страница первая
          
            'main'=>[
                'LProgress',
                'Тиімді микрокредиттер
                жеке тұлғаларға арналған автокөліктің қауіпсіздігі туралы',
                'Несие алу'
            ],
            'about_us'=> [
                'Біз туралы',
                'Уақытша қаржылық қиындықтар - егер сіздің жеке көлігіңіз болса, оңай шешілетін мәселе.',
                'Біздің компания өтініш берген күні көліктің қауіпсіздігіне ақша шығарады.',
                'Біз бірнеше жылдан бері көлік құралдарымен кепілдендірілген шағын несиелер береміз. Клиенттерге ыңғайлы болу үшін 
                жиырмадан астам филиал бүкіл Қазақстан бойынша ірі халықтық орталықтарда жұмыс істейді.',
                'Қысқаша шарттар',
                'Жүргізу құқығымен көлік құралымен қамтамасыз етілген шағын несие. Бұл жағдайда автокөлік пайдалануды 
                жалғастыра отырып, оның қолында шағын несие сомасын алатын клиентте қалады.',
                'Микрокредиттік келісімшарттың барлық мерзімі ішінде көлік құралы біздің компанияның қауіпсіз учаскесінде қалады.
                Клиент кез келген уақытта автотұраққа келіп, көлігінің бүтін және қауіпсіз екендігіне көз жеткізе алады.
                <br> <br>
                Екі жағдайда да кепілдеме жол полициясында немесе әкімдікте тіркеледі.'

            ],
            'numbers'=>[
                'Біз туралы сандар',
                'төлем шегі',
                'өтінішті қарау үшін',
                'өтініш түскен сәттен бастап <br>
                үшін ақша алғанға дейін <br>
                Гол',
                'күннің'
            ],
            'conditions'=> [
                'Шағын қаржыландыру шарттары',
                'Шағын несие мөлшері автомобильдің нарықтық құнының 80% -на жетуі мүмкін, 
                ал шағын несиенің максималды сомасы оң несиелік тарихы бар клиенттерге беріледі.',
                'Шағын несиенің ең төменгі мөлшері - 100 000 теңге. Шағын несиенің максималды сомасы - 25 000 000 теңге',
                '30 күнге сыйақы мөлшерлемесі - 3,7% Жылдық тиімді сыйақы мөлшерлемесі - 18% -дан'
            ],
            'we_best'=> [
                'Неліктен біз жақсырақпыз?',
                'item1'=>[
                    'тез',
                    'Сертификаттарсыз, кепіл берушілерсіз және қажетсіз сұрақтарсыз'
                ],
                'item2'=> [
                    'ЫҢҒАЙЛЫ',
                    'Интернеттегі барлық нәрсе, кеңсеге келместен: мақұлдау және төлемдер'
                ],
                'item3'=>[
                    'БОЛАДЫ',
                    'Жетілмеген несиелік тарихы бас тартуға себеп емес'
                ]
                ],
            'why_best'=>[
                'Неге бізді таңдау керек?',
                'Біз 80% дейін төлейміз',
                'Теңгедегі шағын несиелер',
                'Тіркелу 15 минут',
                'Комиссиялар жоқ',
                'Күнделікті тариф',
                'Ақысыз автотұрақ'
            ],
            'contact'=>
            [
                'Байланыстар'
            ],

            // страница вторая
            'take_debt'=>[
                'Несие алыңыз',
                'Аты',
                'Пошта',
                'Телефон нөмірі',
                'Несие алу'
            ],
            'best_again'=>[
                'Кез-келген мақсатта автокөлікпен қамтамасыз етілген ақша',
                'item1'=>[
                    'Тез',
                    '15 минут',
                    'Отінішті қарау үшін',
                    '3 сағат',
                    'Автокөлікті бағалау үшін',
                    '1 күн',
                    'Ақша сіздің есебіңізде'
                ],
                'item2'=>[
                    'Сенімді',
                    '15 минут',
                    'Отінішті қарау үшін',
                    '1 күн',
                    'Ақша сіздің есебіңізде'
                ],
                'item3'=>[
                    'Пайдалы',
                    '15 минут',
                    'Отінішті қарау үшін',
                    '3 сағат',
                    'Автокөлікті бағалау үшін',
                    '1 күн',
                    'Ақша сіздің есебіңізде'
                ],
            ]
            ];

            return $lang;
    }
    // смена на русский
    if ($langchange == '' ||  $langchange == 'ru') {
        $lang = [
            // меню
            'menu'=>[
                'Условия', 
                'Контакты',
                'Почему мы?',
                'Мы в соцсетях',
                'О нас'
            ],
            // страница главная
            'main'=>[
                'LProgress',
                'Выгодные микрокредиты
                под залог автомобиля для физических лиц',
                'Взять займ'
            ],
            'about_us'=> [
                'О нас',
                'Временные финансовые затруднения легко решаемая проблема,
                 если вы являетесь владельцем автомобиля. ',
                'Наша компания выдает деньги под залог транспортного средства в день обращения.',
                'Мы предоставляем микрокредиты под залог транспортных средств уже не первый год.
                 Для удобства клиентов работают более двух десятков отделений
                 функционируют в крупных населенных центрах по всей территории Казахстана.',
                'Краткие условия',
                'Микрокредит под залог транспортного средства с правом управления.
                 В этом случае автомобиль остается у клиента,
                  который получает на руки сумму микрокредита, продолжая пользоваться автомобилем.',
                'Транспортное средство на весь срок
                 действия договора микрокредита остается на охраняемой площадке нашей компании. 
                В любое время клиент может приехать 
                на стоянку и убедиться, в том, что его 
                автомобиль находится в целостности и сохранности.
                <br> <br>
                В обоих случаях залог регистрируется в дорожной полиции, либо в акимате.'

            ],
            'numbers'=>[
                'О нас в цифрах',
                'предел выплат',
                'на рассмотрение заявки',
                'от получения заявки <br>
                до получения денег на <br>
                счет',
                'дня'
            ],
            'conditions'=> [
                'Условия микредитования',
                'Сумма микрокредита может достигать 80% от рыночной стоимости авто, при этом максимальную
                 сумму микрокредита выдаем клиентам, имеющим положительную кредитную историю.',
                'Минимальная сумма микрокредита – 100 000 тенге. Максимальная сумма микрокредита – 25 000 000 тенге',
                'Ставка вознаграждения за 30 дней —3.7% Годовая эффективная ставка вознаграждения — от 18%'
            ],
            'we_best'=> [
                'Чем мы лучше?',
                'item1'=>[
                    'быстро',
                    'Без справок, поручителей и лишних вопросов'
                ],
                'item2'=> [
                    'УДОБНО',
                    'Все онлайн, без посещения офиса: и одобрение, и платежи'
                ],
                'item3'=>[
                    'ДОСТУПНО',
                    'Неидеальная кредитная история — не причина отказа'
                ]
                ],
                'why_best'=>[
                    'Почему стоит выбрать именно нас?',
                    'Выплачиваем до 80%',
                    'Микрокредиты в тенге',
                    'Оформление 15 минут',
                    'Без комиссий',
                    'Суточная тарификаця',
                    'Бесплатный паркинг'
                ],
                'contact'=>[
                    'Контакты'
                ],

            // страница вторая
            'take_debt'=>[
                'Взять займ в',
                'Имя',
                'Почта',
                'Номер телефона',
                'Оформить займ'
            ],
            'best_again'=>[
                'Деньги под залог автомобиля на любые цели',
                'item1'=>[
                    'Быстро',
                    '15 минут',
                    'На рассмотрение заявки',
                    '3 часа',
                    'На оценку автомобиля',
                    '1 день',
                    'И деньги у вас на счету'
                ],
                'item2'=>[
                    'Надежно',
                    '15 минут',
                    'На рассмотрение заявки',
                    '1 день',
                    'И деньги у вас на счету'
                ],
                'item3'=>[
                    'Выгодно',
                    '15 минут',
                    'На рассмотрение заявки',
                    '3 часа',
                    'На оценку автомобиля',
                    '1 день',
                    'И деньги у вас на счету'
                ],
            ]

            ];

            return $lang;
    }
}

$lan  = lang('kz');
